<a href="https://colab.research.google.com/github/booorayan/Regression_fifa/blob/master/Football_Match_Predictions.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Predicting Football Match Outcomes Using Regression Models

## 1. Defining the Question

### a) Specifying the Question

### b) Defining the Metric for Success

### c) Understanding the context

### d) Recording the Experimental Design

### e) Data Relevance

## 2. Importing Required Libraries

In [0]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

import datetime

## 3. Reading the Data

In [302]:
# Loading the Dataset
# 
#
ranking = pd.read_csv('fifa_ranking.csv')
ranking.head()

   rank country_full  ... confederation   rank_date
0     1      Germany  ...          UEFA  1993-08-08
1     2        Italy  ...          UEFA  1993-08-08
2     3  Switzerland  ...          UEFA  1993-08-08
3     4       Sweden  ...          UEFA  1993-08-08
4     5    Argentina  ...      CONMEBOL  1993-08-08

[5 rows x 16 columns]

In [303]:
ranking.tail()

       rank country_full  ... confederation   rank_date
57788   206     Anguilla  ...      CONCACAF  2018-06-07
57789   206      Bahamas  ...      CONCACAF  2018-06-07
57790   206      Eritrea  ...           CAF  2018-06-07
57791   206      Somalia  ...           CAF  2018-06-07
57792   206        Tonga  ...           OFC  2018-06-07

[5 rows x 16 columns]

In [304]:
results = pd.read_csv('results.csv')
results.head()

         date home_team away_team  ...     city   country neutral
0  1872-11-30  Scotland   England  ...  Glasgow  Scotland   False
1  1873-03-08   England  Scotland  ...   London   England   False
2  1874-03-07  Scotland   England  ...  Glasgow  Scotland   False
3  1875-03-06   England  Scotland  ...   London   England   False
4  1876-03-04  Scotland   England  ...  Glasgow  Scotland   False

[5 rows x 9 columns]

In [305]:
results.tail()

             date         home_team  ... country  neutral
40834  2019-07-18    American Samoa  ...   Samoa     True
40835  2019-07-18              Fiji  ...   Samoa     True
40836  2019-07-19           Senegal  ...   Egypt     True
40837  2019-07-19        Tajikistan  ...   India     True
40838  2019-07-20  Papua New Guinea  ...   Samoa     True

[5 rows x 9 columns]

In [0]:
ran_copy = ranking.copy()
res_copy = results.copy()

## 4. Exploring/Checking the Data

In [307]:
# Determining the no. of records in our dataset
#
ranking.shape

(57793, 16)

In [308]:
results.shape

(40839, 9)

In [309]:
# Previewing the top of our dataset
#

ranking.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 57793 entries, 0 to 57792
Data columns (total 16 columns):
rank                       57793 non-null int64
country_full               57793 non-null object
country_abrv               57793 non-null object
total_points               57793 non-null float64
previous_points            57793 non-null int64
rank_change                57793 non-null int64
cur_year_avg               57793 non-null float64
cur_year_avg_weighted      57793 non-null float64
last_year_avg              57793 non-null float64
last_year_avg_weighted     57793 non-null float64
two_year_ago_avg           57793 non-null float64
two_year_ago_weighted      57793 non-null float64
three_year_ago_avg         57793 non-null float64
three_year_ago_weighted    57793 non-null float64
confederation              57793 non-null object
rank_date                  57793 non-null object
dtypes: float64(9), int64(3), object(4)
memory usage: 7.1+ MB

In [310]:
# Previewing the bottom of our dataset
# 
results.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40839 entries, 0 to 40838
Data columns (total 9 columns):
date          40839 non-null object
home_team     40839 non-null object
away_team     40839 non-null object
home_score    40839 non-null int64
away_score    40839 non-null int64
tournament    40839 non-null object
city          40839 non-null object
country       40839 non-null object
neutral       40839 non-null bool
dtypes: bool(1), int64(2), object(6)
memory usage: 2.5+ MB

In [0]:
# Checking whether each column has an appropriate datatype
#

## 5. Tidying the Dataset

In [312]:
ranking.columns

Index(['rank', 'country_full', 'country_abrv', 'total_points',
       'previous_points', 'rank_change', 'cur_year_avg',
       'cur_year_avg_weighted', 'last_year_avg', 'last_year_avg_weighted',
       'two_year_ago_avg', 'two_year_ago_weighted', 'three_year_ago_avg',
       'three_year_ago_weighted', 'confederation', 'rank_date'],
      dtype='object')

In [313]:
ranking = ranking.drop(ranking.iloc[:,2:15], 1)
ranking.head()

   rank country_full   rank_date
0     1      Germany  1993-08-08
1     2        Italy  1993-08-08
2     3  Switzerland  1993-08-08
3     4       Sweden  1993-08-08
4     5    Argentina  1993-08-08

In [314]:
ranking.tail()

       rank country_full   rank_date
57788   206     Anguilla  2018-06-07
57789   206      Bahamas  2018-06-07
57790   206      Eritrea  2018-06-07
57791   206      Somalia  2018-06-07
57792   206        Tonga  2018-06-07

In [315]:
results.columns

Index(['date', 'home_team', 'away_team', 'home_score', 'away_score',
       'tournament', 'city', 'country', 'neutral'],
      dtype='object')

In [316]:
results = results.drop('city', 1)
results.head()

         date home_team away_team  ...  tournament   country neutral
0  1872-11-30  Scotland   England  ...    Friendly  Scotland   False
1  1873-03-08   England  Scotland  ...    Friendly   England   False
2  1874-03-07  Scotland   England  ...    Friendly  Scotland   False
3  1875-03-06   England  Scotland  ...    Friendly   England   False
4  1876-03-04  Scotland   England  ...    Friendly  Scotland   False

[5 rows x 8 columns]

In [317]:
res_fil = results[results.neutral == False]
res_fil.tail()

             date home_team  ... country  neutral
40803  2019-07-08     Samoa  ...   Samoa    False
40817  2019-07-12     Samoa  ...   Samoa    False
40821  2019-07-13     India  ...   India    False
40829  2019-07-16     India  ...   India    False
40832  2019-07-18     Samoa  ...   Samoa    False

[5 rows x 8 columns]

In [318]:
res_fil.tournament.unique()

array(['Friendly', 'British Championship', 'Copa Lipton', 'Copa Newton',
       'Copa Premio Honor Argentino', 'Copa Premio Honor Uruguayo',
       'Copa Roca', 'Copa Am√©rica', 'Copa Chevallier Boutell',
       'Nordic Championship', 'International Cup', 'Baltic Cup',
       'Balkan Cup', 'FIFA World Cup', 'Copa Rio Branco',
       'FIFA World Cup qualification', 'CCCF Championship',
       'NAFU Championship', 'Copa Oswaldo Cruz',
       'Pan American Championship', 'Copa del Pac√≠fico',
       "Copa Bernardo O'Higgins", 'AFC Asian Cup qualification',
       'Atlantic Cup', 'AFC Asian Cup', 'African Cup of Nations',
       'Copa Paz del Chaco', 'UEFA Euro qualification', 'UEFA Euro',
       'Merdeka Tournament', 'Windward Islands Tournament',
       'African Cup of Nations qualification', 'Vietnam Independence Cup',
       'Copa Carlos Dittborn', 'Copa Juan Pinto Dur√°n', 'UAFA Cup',
       'CONCACAF Championship', 'South Pacific Games',
       'CONCACAF Championship qualification', 'Copa Artigas', 'GaNEFo',
       "King's Cup", 'Gulf Cup', 'Indonesia Tournament', 'Korea Cup',
       'Brazil Independence Cup', 'Copa Ram√≥n Castilla',
       'Oceania Nations Cup', 'CECAFA Cup', 'Copa F√©lix Bogado',
       'Kirin Cup', 'CFU Caribbean Cup qualification',
       'CFU Caribbean Cup', 'Am√≠lcar Cabral Cup', 'Mundialito',
       'West African Cup', 'Nehru Cup', 'Merlion Cup', 'UDEAC Cup',
       'Rous Cup', 'Tournoi de France', 'Malta International Tournament',
       'Lunar New Year Cup', 'Island Games', 'Dynasty Cup', 'UNCAF Cup',
       'Gold Cup', 'USA Cup', 'Jordan International Tournament',
       'Confederations Cup', 'United Arab Emirates Friendship Tournament',
       'Oceania Nations Cup qualification', 'Simba Tournament',
       'SAFF Cup', 'AFF Championship', 'King Hassan II Tournament',
       'Cyprus International Tournament', 'Dunhill Cup', 'COSAFA Cup',
       'Gold Cup qualification', 'SKN Football Festival', 'UNIFFAC Cup',
       'WAFF Championship', 'Millennium Cup', "Prime Minister's Cup",
       'EAFF Championship', 'AFC Challenge Cup', 'FIFI Wild Cup',
       'Viva World Cup', 'ELF Cup', 'UAFA Cup qualification',
       'AFC Challenge Cup qualification', 'VFF Cup', 'ABCS Tournament',
       'Nile Basin Tournament', 'Nations Cup', 'Pacific Games',
       'African Nations Championship', 'OSN Cup',
       'CONIFA World Football Cup', 'CONIFA European Football Cup',
       'Copa Am√©rica qualification', 'World Unity Cup',
       'Intercontinental Cup', 'UEFA Nations League',
       'AFF Championship qualification', 'Atlantic Heritage Cup',
       'Inter Games Football Tournament'], dtype=object)

In [319]:
# filtering by tournament 
tourna = ['Friendly', 'FIFA World Cup', 'Copa Am√©rica', 'UEFA Euro']
res_f = res_fil[res_fil['tournament'].isin(tourna)]
res_f.head()

         date home_team away_team  ...  tournament   country neutral
0  1872-11-30  Scotland   England  ...    Friendly  Scotland   False
1  1873-03-08   England  Scotland  ...    Friendly   England   False
2  1874-03-07  Scotland   England  ...    Friendly  Scotland   False
3  1875-03-06   England  Scotland  ...    Friendly   England   False
4  1876-03-04  Scotland   England  ...    Friendly  Scotland   False

[5 rows x 8 columns]

In [320]:
res_f.tail()

             date home_team  away_team  ...    tournament  country neutral
40682  2019-06-14    Brazil    Bolivia  ...  Copa Am√©rica   Brazil   False
40707  2019-06-18    Brazil  Venezuela  ...  Copa Am√©rica   Brazil   False
40761  2019-06-27    Brazil   Paraguay  ...  Copa Am√©rica   Brazil   False
40787  2019-07-02    Brazil  Argentina  ...  Copa Am√©rica   Brazil   False
40798  2019-07-07    Brazil       Peru  ...  Copa Am√©rica   Brazil   False

[5 rows x 8 columns]

In [321]:

res_f['year'] = pd.DatetimeIndex(res_f['date']).year
res_f['month'] = pd.DatetimeIndex(res_f['date']).month
res_f['day'] = pd.DatetimeIndex(res_f['date']).day

res_f.head()

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  This is separate from the ipykernel package so we can avoid doing imports until
/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  after removing the cwd from sys.path.

         date home_team away_team  home_score  ...  neutral  year month  day
0  1872-11-30  Scotland   England           0  ...    False  1872    11   30
1  1873-03-08   England  Scotland           4  ...    False  1873     3    8
2  1874-03-07  Scotland   England           2  ...    False  1874     3    7
3  1875-03-06   England  Scotland           2  ...    False  1875     3    6
4  1876-03-04  Scotland   England           3  ...    False  1876     3    4

[5 rows x 11 columns]

In [322]:
r_f = res_f[res_f['year'].between(2006,2018, inclusive=True)]
r_f.head()

             date home_team     away_team  ...  year  month day
28033  2006-01-02     Qatar         Libya  ...  2006      1   2
28034  2006-01-05     Egypt      Zimbabwe  ...  2006      1   5
28036  2006-01-09   Morocco      DR Congo  ...  2006      1   9
28038  2006-01-12   Tunisia         Libya  ...  2006      1  12
28039  2006-01-14     Egypt  South Africa  ...  2006      1  14

[5 rows x 11 columns]

In [323]:
r_f.dtypes

date          object
home_team     object
away_team     object
home_score     int64
away_score     int64
tournament    object
country       object
neutral         bool
year           int64
month          int64
day            int64
dtype: object

In [324]:
r_f.home_score.iloc[0]

2

In [325]:
status = []

for i in range(len(r_f['home_team'])):
  if r_f.home_score.iloc[i] > r_f.away_score.iloc[i]:
    status.append('Win')
  elif r_f['home_score'].iloc[i] < r_f.away_score.iloc[i]:
    status.append('Lose')
  else:
    status.append('Draw')
  
  
    
    
#     if (r_f[''][i] > j):
#       status.append('Win')
#     elif (i < j):
#       status.append('Lose')
#     else:
#       status.append('Draw')
      
# #   if (r_f['home_score'][i]) > (r_f['away_score'][i]):
# #     status.append('Win')
# #   elif r_f['home_score'][i] < r_f['away_score'][i]:
# #     status.append('Lose')
# #   else:
# #     status.append('Draw')

    
r_f['status'] = status
# r_f.apply(lambda col: col.drop_duplicates().reset_index(drop=True))

r_f.head(10)

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:29: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

             date     home_team     away_team  ...  month  day status
28033  2006-01-02         Qatar         Libya  ...      1    2    Win
28034  2006-01-05         Egypt      Zimbabwe  ...      1    5    Win
28036  2006-01-09       Morocco      DR Congo  ...      1    9    Win
28038  2006-01-12       Tunisia         Libya  ...      1   12    Win
28039  2006-01-14         Egypt  South Africa  ...      1   14   Lose
28040  2006-01-14       Morocco      Zimbabwe  ...      1   14    Win
28041  2006-01-14       Senegal      DR Congo  ...      1   14   Draw
28042  2006-01-15       Tunisia         Ghana  ...      1   15    Win
28044  2006-01-17       Morocco        Angola  ...      1   17   Draw
28045  2006-01-18  Saudi Arabia        Sweden  ...      1   18   Draw

[10 rows x 12 columns]

In [326]:
res_f = res_f[res_f['year'] == 2018]
res_f.head()

fil_res = res_f[~(res_f['month'] > 6)]
fil_res.head()

             date      home_team               away_team  ...  year  month day
39501  2018-01-11      Indonesia                 Iceland  ...  2018      1  11
39504  2018-01-14      Indonesia                 Iceland  ...  2018      1  14
39531  2018-01-28  United States  Bosnia and Herzegovina  ...  2018      1  28
39534  2018-01-28      Yorkshire            Ellan Vannin  ...  2018      1  28
39543  2018-02-26   Saudi Arabia                 Moldova  ...  2018      2  26

[5 rows x 11 columns]

In [327]:
res_f.head()

             date      home_team               away_team  ...  year  month day
39501  2018-01-11      Indonesia                 Iceland  ...  2018      1  11
39504  2018-01-14      Indonesia                 Iceland  ...  2018      1  14
39531  2018-01-28  United States  Bosnia and Herzegovina  ...  2018      1  28
39534  2018-01-28      Yorkshire            Ellan Vannin  ...  2018      1  28
39543  2018-02-26   Saudi Arabia                 Moldova  ...  2018      2  26

[5 rows x 11 columns]

In [328]:
res_fi = fil_res.drop(['date','neutral'], 1)
res_fi.tail()

      home_team     away_team  home_score  ...  year month day
39859   Belgium    Costa Rica           4  ...  2018     6  11
39861    Poland     Lithuania           4  ...  2018     6  12
39862    Russia  Saudi Arabia           5  ...  2018     6  14
39878    Russia         Egypt           3  ...  2018     6  19
39894    Russia       Uruguay           0  ...  2018     6  25

[5 rows x 9 columns]

In [329]:
res_fi[(res_fi['day'] > 7) & (res_fi['month'] == 6)]

         home_team      away_team  home_score  ...  year month day
39834      Germany   Saudi Arabia           2  ...  2018     6   8
39835      Croatia        Senegal           2  ...  2018     6   8
39836  Switzerland          Japan           2  ...  2018     6   8
39838       Poland          Chile           2  ...  2018     6   8
39841      Denmark         Mexico           2  ...  2018     6   9
39842       Sweden           Peru           0  ...  2018     6   9
39843      Hungary      Australia           1  ...  2018     6   9
39844      Estonia        Morocco           1  ...  2018     6   9
39845       Latvia     Azerbaijan           1  ...  2018     6   9
39846      Finland        Belarus           2  ...  2018     6   9
39848       France  United States           1  ...  2018     6   9
39856      Austria         Brazil           0  ...  2018     6  10
39859      Belgium     Costa Rica           4  ...  2018     6  11
39861       Poland      Lithuania           4  ...  2018     6  12
39862       Russia   Saudi Arabia           5  ...  2018     6  14
39878       Russia          Egypt           3  ...  2018     6  19
39894       Russia        Uruguay           0  ...  2018     6  25

[17 rows x 9 columns]

In [330]:
ranking['year'] = pd.DatetimeIndex(ranking['rank_date']).year
ranking['month'] = pd.DatetimeIndex(ranking['rank_date']).month
ranking['day'] = pd.DatetimeIndex(ranking['rank_date']).day

ranking.head()

   rank country_full   rank_date  year  month  day
0     1      Germany  1993-08-08  1993      8    8
1     2        Italy  1993-08-08  1993      8    8
2     3  Switzerland  1993-08-08  1993      8    8
3     4       Sweden  1993-08-08  1993      8    8
4     5    Argentina  1993-08-08  1993      8    8

In [331]:
rank_f = ranking[ranking['year'].between(2006,2018,inclusive=True)]
rank_f.head()

       rank    country_full   rank_date  year  month  day
26938     1          Brazil  2006-01-18  2006      1   18
26939     2  Czech Republic  2006-01-18  2006      1   18
26940     3     Netherlands  2006-01-18  2006      1   18
26941     4       Argentina  2006-01-18  2006      1   18
26942     5           Spain  2006-01-18  2006      1   18

In [332]:
rank_f.tail()

       rank country_full   rank_date  year  month  day
57788   206     Anguilla  2018-06-07  2018      6    7
57789   206      Bahamas  2018-06-07  2018      6    7
57790   206      Eritrea  2018-06-07  2018      6    7
57791   206      Somalia  2018-06-07  2018      6    7
57792   206        Tonga  2018-06-07  2018      6    7

In [333]:
ran_f = rank_f.drop('rank_date', 1)
ran_f.tail()

       rank country_full  year  month  day
57788   206     Anguilla  2018      6    7
57789   206      Bahamas  2018      6    7
57790   206      Eritrea  2018      6    7
57791   206      Somalia  2018      6    7
57792   206        Tonga  2018      6    7

In [211]:
gr = ran_f.groupby(['country_full', 'rank'])['month'].unique()
gr

# rank changes almost every month

country_full         rank
Afghanistan          140              [5]
                     142              [4]
                     145              [6]
                     148        [1, 2, 3]
Albania              56            [4, 5]
                     58            [3, 6]
                     59               [2]
                     60               [1]
Algeria              57               [1]
                     60            [2, 3]
                     62               [4]
                     64               [5]
                     66               [6]
American Samoa       191           [4, 5]
                     192              [6]
                     194        [1, 2, 3]
Andorra              130           [3, 6]
                     132           [4, 5]
                     136              [1]
                     137              [2]
Angola               137              [6]
                     138           [4, 5]
                     141           [2, 3]
                     142              [1]
Anguilla             206     [1, 2, 3, 6]
                     207           [4, 5]
Antigua and Barbuda  124           [4, 5]
                     126              [6]
                     139           [1, 3]
                     140              [2]
                                 ...
Vanuatu              156     [1, 2, 3, 4]
                     162              [6]
Venezuela            33               [6]
                     39            [4, 5]
                     48            [2, 3]
                     52               [1]
Vietnam              102           [5, 6]
                     103              [4]
                     112           [1, 2]
                     113              [3]
Wales                18               [6]
                     19               [1]
                     20            [2, 3]
                     21            [4, 5]
Yemen                124              [5]
                     125              [4]
                     133              [6]
                     138              [1]
                     139              [2]
                     140              [3]
Zambia               72               [1]
                     76            [2, 6]
                     77               [3]
                     78            [4, 5]
Zimbabwe             105              [2]
                     106              [1]
                     108              [3]
                     110              [4]
                     113              [5]
                     118              [6]
Name: month, Length: 797, dtype: object

In [212]:
ran_f[ran_f['month'] == 5].head()

       rank country_full  year  month  day
57371     1      Germany  2018      5   17
57372     2       Brazil  2018      5   17
57373     3      Belgium  2018      5   17
57374     4     Portugal  2018      5   17
57375     5    Argentina  2018      5   17

In [0]:
# Checking for Anomalies
#

In [0]:
# Identifying the Missing Data
#

In [0]:
# Dealing with the Missing Data
#

In [0]:
# More data cleaning procedures
#

## 6. Exploratory Analysis

In [0]:
# Ploting the univariate summaries and recording our observations
#

## 7. Implementing the Solution

In [0]:
# Implementing the Solution
#

## 8. Challenging the solution

> The easy solution is nice because it is, well, easy, but you should never allow those results to hold the day. You should always be thinking of ways to challenge the results, especially if those results comport with your prior expectation.

In [0]:
# Reviewing the Solution 
#

## 9. Follow up questions

> At this point, we can refine our question or collect new data, all in an iterative process to get at the truth.

### a). Did we have the right data?

### b). Do we need other data to answer our question?

### c). Did we have the right question?